
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        1 |           6 |          0 |
## Affected resources by action

|  Action  | Resources                                                     |
|:--------:|:--------------------------------------------------------------|
|    🟢    | `module.management.aws_s3_bucket_policy.vpc_flow_logs[0]`     |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`        |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`              |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`          |
|    🟡    | `module.management.aws_vpc.vpc`                               |
|    🟡    | `module.keycloak.module.pod[0].aws_autoscaling_group.website` |
|    🟡    | `module.keycloak.module.pod[0].aws_launch_template.website`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "27" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-046070fb756e4377e" -> "ami-0742eb7300e2d407c"
      ~ latest_version                       = 27 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.management.aws_s3_bucket_policy.vpc_flow_logs[0] will be created
  + resource "aws_s3_bucket_policy" "vpc_flow_logs" {
      + bucket = "vpc-flow-logs-management-20250519164544296400000001"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::vpc-flow-logs-management-20250519164544296400000001/*",
                          + "arn:aws:s3:::vpc-flow-logs-management-20250519164544296400000001",
                        ]
                      + Sid       = "AllowSSLRequestsOnly"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:logs:us-west-1:493370826424:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "493370826424"
                              + "s3:x-amz-acl"      = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::vpc-flow-logs-management-20250519164544296400000001/AWSLogs/493370826424/*"
                      + Sid       = "AWSLogDeliveryWrite1"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:logs:us-west-1:493370826424:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "493370826424"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::vpc-flow-logs-management-20250519164544296400000001"
                      + Sid       = "AWSLogDeliveryAclCheck1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.management.aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-08e19d859c26d18b2"
      ~ tags                                 = {
            "Name"              = "VPC for management (production) 10.0.0.0/22"
            "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "management"        = "true"
          ~ "module_version"    = "3.1.1" -> "3.1.2"
            "service"           = "management"
        }
      ~ tags_all                             = {
          ~ "module_version"    = "3.1.1" -> "3.1.2"
            # (6 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.keycloak.module.pod[0].aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "auth2024030222363784960000000d"
        name                             = "auth2024030222363784960000000d"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "8" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (16 unchanged blocks hidden)
    }

  # module.keycloak.module.pod[0].aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0d93139ab32de43aa"
      ~ image_id                             = "ami-005d6d97f4fd5360b" -> "ami-0b661dc3de2dae64f"
      ~ latest_version                       = 8 -> (known after apply)
        name                                 = "auth2024030222363750480000000b"
        tags                                 = {
            "AmazonECSManaged"      = "true"
            "Name"                  = "auth"
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/website-pod/aws"
            "environment"           = "development"
            "parent_module"         = "infrahouse/ecs/aws"
            "service"               = "auth"
            "upstream_module"       = "infrahouse/ecs/aws"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiA2LCAiZGVzdHJveSI6IDB9fQ==
```
</details>